interface IPokemon {
  no: number;
  name: string;
}
interface IPokemonLists {
  [key: string]: IPokemon[];
}

const ア = [
  { no: 567, name: "アーケオス" },
  { no: 23, name: "アーボ" },
  { no: 24, name: "アーボック" },
  { no: 348, name: "アーマルド" },
  { no: 632, name: "アイアント" },
  { no: 617, name: "アギルダー" },
  { no: 799, name: "アクジキング" },
  { no: 482, name: "アグノム" },
  { no: 267, name: "アゲハント" },
  { no: 736, name: "アゴジムシ" },
  { no: 728, name: "アシマリ" },
  { no: 730, name: "アシレーヌ" },
  { no: 119, name: "アズマオウ" },
  { no: 255, name: "アチャモ" },
  { no: 347, name: "アノプス" },
  { no: 565, name: "アバゴーラ" },
  { no: 359, name: "アブソル" },
  { no: 742, name: "アブリー" },
  { no: 763, name: "アマージョ" },
  { no: 761, name: "アマカジ" },
  { no: 762, name: "アママイコ" },
  { no: 698, name: "アマルス" },
  { no: 699, name: "アマルルガ" },
  { no: 283, name: "アメタマ" },
  { no: 284, name: "アメモース" },
  { no: 168, name: "アリアドス" },
  { no: 159, name: "アリゲイツ" },
  { no: 493, name: "アルセウス" },
  { no: 201, name: "アンノーン" }
];

const イ = [
  { no: 133, name: "イーブイ" },
  { no: 557, name: "イシズマイ" },
  { no: 74, name: "イシツブテ" },
  { no: 167, name: "イトマル" },
  { no: 221, name: "イノムー" },
  { no: 717, name: "イベルタル" },
  { no: 314, name: "イルミーゼ" },
  { no: 95, name: "イワーク" },
  { no: 558, name: "イワパレス" },
  { no: 744, name: "イワンコ" }
];

const ウ = [
  { no: 59, name: "ウインディ" },
  { no: 628, name: "ウォーグル" },
  { no: 185, name: "ウソッキー" },
  { no: 438, name: "ウソハチ" },
  { no: 71, name: "ウツボット" },
  { no: 793, name: "ウツロイド" },
  { no: 692, name: "ウデッポウ" },
  { no: 194, name: "ウパー" },
  { no: 220, name: "ウリムー" },
  { no: 637, name: "ウルガモス" }
];

const エ = [
  { no: 227, name: "エアームド" },
  { no: 190, name: "エイパム" },
  { no: 196, name: "エーフィ" },
  { no: 424, name: "エテボース" },
  { no: 300, name: "エネコ" },
  { no: 301, name: "エネコロロ" },
  { no: 107, name: "エビワラー" },
  { no: 481, name: "エムリット" },
  { no: 587, name: "エモンガ" },
  { no: 694, name: "エリキテル" },
  { no: 475, name: "エルレイド" },
  { no: 239, name: "エレキッド" },
  { no: 466, name: "エレキブル" },
  { no: 695, name: "エレザード" },
  { no: 125, name: "エレブー" },
  { no: 244, name: "エンテイ" },
  { no: 758, name: "エンニュート" },
  { no: 500, name: "エンブオー" },
  { no: 395, name: "エンペルト" }
];

const オ = [
  { no: 277, name: "オオスバメ" },
  { no: 160, name: "オーダイル" },
  { no: 162, name: "オオタチ" },
  { no: 606, name: "オーベム" },
  { no: 709, name: "オーロット" },
  { no: 57, name: "オコリザル" },
  { no: 729, name: "オシャマリ" },
  { no: 161, name: "オタチ" },
  { no: 535, name: "オタマロ" },
  { no: 234, name: "オドシシ" },
  { no: 741, name: "オドリドリ" },
  { no: 362, name: "オニゴーリ" },
  { no: 752, name: "オニシズクモ" },
  { no: 21, name: "オニスズメ" },
  { no: 22, name: "オニドリル" },
  { no: 612, name: "オノノクス" },
  { no: 611, name: "オノンド" },
  { no: 139, name: "オムスター" },
  { no: 138, name: "オムナイト" },
  { no: 714, name: "オンバット" }
];

const カ = [
  { no: 58, name: "ガーディ" },
  { no: 414, name: "ガーメイル" },
  { no: 382, name: "カイオーガ" },
  { no: 68, name: "カイリキー" },
  { no: 149, name: "カイリュー" },
  { no: 127, name: "カイロス" },
  { no: 668, name: "カエンジシ" },
  { no: 353, name: "カゲボウズ" },
  { no: 712, name: "カチコール" },
  { no: 697, name: "ガチゴラス" },
  { no: 444, name: "ガバイト" },
  { no: 785, name: "カプ・コケコ" },
  { no: 786, name: "カプ・テテフ" },
  { no: 140, name: "カブト" },
  { no: 141, name: "カブトプス" },
  { no: 787, name: "カプ・ブルル" },
  { no: 445, name: "ガブリアス" },
  { no: 588, name: "カブルモ" },
  { no: 788, name: "カプ・レヒレ" },
  { no: 237, name: "カポエラー" },
  { no: 536, name: "ガマガル" },
  { no: 537, name: "ガマゲロゲ" },
  { no: 798, name: "カミツルギ" },
  { no: 8, name: "カメール" },
  { no: 9, name: "カメックス" },
  { no: 688, name: "カメテテ" },
  { no: 689, name: "ガメノデス" },
  { no: 83, name: "カモネギ" },
  { no: 104, name: "カラカラ" },
  { no: 105, name: "ガラガラ" },
  { no: 266, name: "カラサリス" },
  { no: 422, name: "カラナクシ" },
  { no: 687, name: "カラマネロ" },
  { no: 753, name: "カリキリ" },
  { no: 115, name: "ガルーラ" },
  { no: 525, name: "ガントル" }
];

const キ = [
  { no: 599, name: "ギアル" },
  { no: 526, name: "ギガイアス" },
  { no: 600, name: "ギギアル" },
  { no: 601, name: "ギギギアル" },
  { no: 760, name: "キテルグマ" },
  { no: 286, name: "キノガッサ" },
  { no: 285, name: "キノココ" },
  { no: 610, name: "キバゴ" },
  { no: 318, name: "キバニア" },
  { no: 192, name: "キマワリ" },
  { no: 252, name: "キモリ" },
  { no: 10, name: "キャタピー" },
  { no: 278, name: "キャモメ" },
  { no: 130, name: "ギャラドス" },
  { no: 78, name: "ギャロップ" },
  { no: 646, name: "キュレム" },
  { no: 764, name: "キュワワー" },
  { no: 487, name: "ギラティナ" },
  { no: 203, name: "キリンリキ" },
  { no: 681, name: "ギルガルド" },
  { no: 281, name: "キルリア" },
  { no: 182, name: "キレイハナ" },
  { no: 230, name: "キングドラ" },
  { no: 99, name: "キングラー" }
];

const ク = [
  { no: 44, name: "クサイハナ" },
  { no: 690, name: "クズモー" },
  { no: 768, name: "グソクムシャ" },
  { no: 303, name: "クチート" },
  { no: 204, name: "クヌギダマ" },
  { no: 207, name: "グライガー" },
  { no: 262, name: "グラエナ" },
  { no: 98, name: "クラブ" },
  { no: 210, name: "グランブル" },
  { no: 541, name: "クルマユ" },
  { no: 540, name: "クルミル" },
  { no: 471, name: "グレイシア" },
  { no: 488, name: "クレセリア" },
  { no: 453, name: "グレッグル" },
  { no: 707, name: "クレッフィ" },
  { no: 713, name: "クレベース" },
  { no: 169, name: "クロバット" },
  { no: 738, name: "クワガノン" }
];

const ケ = [
  { no: 456, name: "ケイコウオ" },
  { no: 63, name: "ケーシィ" },
  { no: 740, name: "ケケンカニ" },
  { no: 657, name: "ゲコガシラ" },
  { no: 289, name: "ケッキング" },
  { no: 658, name: "ゲッコウガ" },
  { no: 649, name: "ゲノセクト" },
  { no: 265, name: "ケムッソ" },
  { no: 732, name: "ケララッパ" },
  { no: 647, name: "ケルディオ" },
  { no: 656, name: "ケロマツ" },
  { no: 94, name: "ゲンガー" },
  { no: 128, name: "ケンタロス" },
  { no: 521, name: "ケンホロウ" }
];

const コ = [
  { no: 580, name: "コアルヒー" },
  { no: 129, name: "コイキング" },
  { no: 81, name: "コイル" },
  { no: 392, name: "ゴウカザル" },
  { no: 673, name: "ゴーゴート" },
  { no: 92, name: "ゴース" },
  { no: 93, name: "ゴースト" },
  { no: 324, name: "コータス" },
  { no: 67, name: "ゴーリキー" },
  { no: 304, name: "ココドラ" },
  { no: 528, name: "ココロモリ" },
  { no: 619, name: "コジョフー" },
  { no: 620, name: "コジョンド" },
  { no: 790, name: "コスモウム" },
  { no: 789, name: "コスモッグ" },
  { no: 767, name: "コソクムシ" },
  { no: 54, name: "コダック" },
  { no: 575, name: "ゴチミル" },
  { no: 574, name: "ゴチム" },
  { no: 576, name: "ゴチルゼル" },
  { no: 305, name: "コドラ" },
  { no: 293, name: "ゴニョニョ" },
  { no: 274, name: "コノハナ" },
  { no: 622, name: "ゴビット" },
  { no: 665, name: "コフーライ" },
  { no: 664, name: "コフキムシ" },
  { no: 231, name: "ゴマゾウ" },
  { no: 624, name: "コマタナ" },
  { no: 372, name: "コモルー" },
  { no: 19, name: "コラッタ" },
  { no: 403, name: "コリンク" },
  { no: 623, name: "ゴルーグ" },
  { no: 55, name: "ゴルダック" },
  { no: 42, name: "ゴルバット" },
  { no: 76, name: "ゴローニャ" },
  { no: 402, name: "コロトック" },
  { no: 401, name: "コロボーシ" },
  { no: 527, name: "コロモリ" },
  { no: 675, name: "ゴロンダ" },
  { no: 446, name: "ゴンベ" }
];

const サ = [
  { no: 282, name: "サーナイト" },
  { no: 368, name: "サクラビス" },
  { no: 635, name: "サザンドラ" },
  { no: 247, name: "サナギラス" },
  { no: 222, name: "サニーゴ" },
  { no: 331, name: "サボネア" },
  { no: 356, name: "サマヨール" },
  { no: 319, name: "サメハダー" },
  { no: 106, name: "サワムラー" },
  { no: 335, name: "ザングース" },
  { no: 145, name: "サンダー" },
  { no: 135, name: "サンダース" },
  { no: 27, name: "サンド" },
  { no: 28, name: "サンドパン" }
];

const シ = [
  { no: 117, name: "シードラ" },
  { no: 369, name: "ジーランス" },
  { no: 492, name: "シェイミ" },
  { no: 90, name: "シェルダー" },
  { no: 718, name: "ジガルデ" },
  { no: 585, name: "シキジカ" },
  { no: 263, name: "ジグザグマ" },
  { no: 342, name: "シザリガー" },
  { no: 667, name: "シシコ" },
  { no: 751, name: "シズクモ" },
  { no: 462, name: "ジバコイル" },
  { no: 602, name: "シビシラス" },
  { no: 603, name: "シビビール" },
  { no: 634, name: "ジヘッド" },
  { no: 522, name: "シママ" },
  { no: 496, name: "ジャノビー" },
  { no: 782, name: "ジャラコ" },
  { no: 784, name: "ジャラランガ" },
  { no: 783, name: "ジャランゴ" },
  { no: 497, name: "ジャローダ" },
  { no: 134, name: "シャワーズ" },
  { no: 609, name: "シャンデラ" },
  { no: 682, name: "シュシュプ" },
  { no: 724, name: "ジュナイパー" },
  { no: 589, name: "シュバルゴ" },
  { no: 253, name: "ジュプトル" },
  { no: 354, name: "ジュペッタ" },
  { no: 385, name: "ジラーチ" },
  { no: 773, name: "シルヴァディ" },
  { no: 770, name: "シロデスナ" },
  { no: 561, name: "シンボラー" }
];

const ス = [
  { no: 408, name: "ズガイドス" },
  { no: 435, name: "スカタンク" },
  { no: 434, name: "スカンプー" },
  { no: 451, name: "スコルピ" },
  { no: 121, name: "スターミー" },
  { no: 123, name: "ストライク" },
  { no: 769, name: "スナバァ" },
  { no: 41, name: "ズバット" },
  { no: 276, name: "スバメ" },
  { no: 15, name: "スピアー" },
  { no: 406, name: "スボミー" },
  { no: 97, name: "スリーパー" },
  { no: 96, name: "スリープ" },
  { no: 559, name: "ズルッグ" },
  { no: 581, name: "スワンナ" }
];

const セ = [
  { no: 644, name: "ゼクロム" },
  { no: 7, name: "ゼニガメ" },
  { no: 523, name: "ゼブライカ" },
  { no: 807, name: "ゼラオラ" },
  { no: 716, name: "ゼルネアス" },
  { no: 251, name: "セレビィ" }
];

const ソ = [
  { no: 360, name: "ソーナノ" },
  { no: 202, name: "ソーナンス" },
  { no: 791, name: "ソルガレオ" },
  { no: 338, name: "ソルロック" },
  { no: 570, name: "ゾロア" },
  { no: 571, name: "ゾロアーク" }
];

const タ = [
  { no: 491, name: "ダークライ" },
  { no: 275, name: "ダーテング" },
  { no: 503, name: "ダイケンキ" },
  { no: 476, name: "ダイノーズ" },
  { no: 772, name: "タイプ：ヌル" },
  { no: 51, name: "ダグトリオ" },
  { no: 539, name: "ダゲキ" },
  { no: 569, name: "ダストダス" },
  { no: 116, name: "タッツー" },
  { no: 371, name: "タツベイ" },
  { no: 410, name: "タテトプス" },
  { no: 273, name: "タネボー" },
  { no: 531, name: "タブンネ" },
  { no: 590, name: "タマゲタケ" },
  { no: 363, name: "タマザラシ" },
  { no: 102, name: "タマタマ" },
  { no: 458, name: "タマンタ" },
  { no: 554, name: "ダルマッカ" },
  { no: 524, name: "ダンゴロ" },
  { no: 374, name: "ダンバル" }
];

const チ = [
  { no: 421, name: "チェリム" },
  { no: 420, name: "チェリンボ" },
  { no: 696, name: "チゴラス" },
  { no: 152, name: "チコリータ" },
  { no: 308, name: "チャーレム" },
  { no: 499, name: "チャオブー" },
  { no: 548, name: "チュリネ" },
  { no: 616, name: "チョボマキ" },
  { no: 509, name: "チョロネコ" },
  { no: 170, name: "チョンチー" },
  { no: 572, name: "チラーミィ" },
  { no: 573, name: "チラチーノ" },
  { no: 334, name: "チルタリス" },
  { no: 333, name: "チルット" }
];

const ツ = [
  { no: 495, name: "ツタージャ" },
  { no: 731, name: "ツツケラ" },
  { no: 213, name: "ツボツボ" },
  { no: 805, name: "ツンデツンデ" },
  { no: 614, name: "ツンベアー" }
];

const テ = [
  { no: 483, name: "ディアルガ" },
  { no: 719, name: "ディアンシー" },
  { no: 50, name: "ディグダ" },
  { no: 654, name: "テールナー" },
  { no: 386, name: "デオキシス" },
  { no: 735, name: "デカグース" },
  { no: 562, name: "デスマス" },
  { no: 797, name: "テッカグヤ" },
  { no: 597, name: "テッシード" },
  { no: 223, name: "テッポウオ" },
  { no: 702, name: "デデンネ" },
  { no: 225, name: "デリバード" },
  { no: 228, name: "デルビル" },
  { no: 796, name: "デンジュモク" },
  { no: 737, name: "デンヂムシ" },
  { no: 596, name: "デンチュラ" },
  { no: 181, name: "デンリュウ" }
];

const ト = [
  { no: 84, name: "ドードー" },
  { no: 85, name: "ドードリオ" },
  { no: 235, name: "ドーブル" },
  { no: 436, name: "ドーミラー" },
  { no: 109, name: "ドガース" },
  { no: 73, name: "ドククラゲ" },
  { no: 269, name: "ドクケイル" },
  { no: 454, name: "ドクロッグ" },
  { no: 468, name: "トゲキッス" },
  { no: 176, name: "トゲチック" },
  { no: 777, name: "トゲデマル" },
  { no: 175, name: "トゲピー" },
  { no: 294, name: "ドゴーム" },
  { no: 118, name: "トサキント" },
  { no: 339, name: "ドジョッチ" },
  { no: 389, name: "ドダイトス" },
  { no: 532, name: "ドッコラー" },
  { no: 733, name: "ドデカバシ" },
  { no: 533, name: "ドテッコツ" },
  { no: 364, name: "トドグラー" },
  { no: 365, name: "トドゼルガ" },
  { no: 748, name: "ドヒドイデ" },
  { no: 691, name: "ドラミドロ" },
  { no: 11, name: "トランセル" },
  { no: 411, name: "トリデプス" },
  { no: 530, name: "ドリュウズ" },
  { no: 641, name: "トルネロス" },
  { no: 549, name: "ドレディア" },
  { no: 749, name: "ドロバンコ" },
  { no: 357, name: "トロピウス" },
  { no: 430, name: "ドンカラス" },
  { no: 322, name: "ドンメル" }
];

const ナ = [
  { no: 387, name: "ナエトル" },
  { no: 538, name: "ナゲキ" },
  { no: 766, name: "ナゲツケサル" },
  { no: 43, name: "ナゾノクサ" },
  { no: 328, name: "ナックラー" },
  { no: 103, name: "ナッシー" },
  { no: 598, name: "ナットレイ" },
  { no: 287, name: "ナマケロ" },
  { no: 771, name: "ナマコブシ" },
  { no: 340, name: "ナマズン" }
];

const ニ = [
  { no: 680, name: "ニダンギル" },
  { no: 34, name: "ニドキング" },
  { no: 32, name: "ニドラン♂" },
  { no: 29, name: "ニドラン♀" },
  { no: 30, name: "ニドリーナ" },
  { no: 33, name: "ニドリーノ" },
  { no: 52, name: "ニャース" },
  { no: 678, name: "ニャオニクス" },
  { no: 677, name: "ニャスパー" },
  { no: 725, name: "ニャビー" },
  { no: 726, name: "ニャヒート" },
  { no: 431, name: "ニャルマー" },
  { no: 215, name: "ニューラ" },
  { no: 61, name: "ニョロゾ" },
  { no: 186, name: "ニョロトノ" },
  { no: 60, name: "ニョロモ" },
  { no: 700, name: "ニンフィア" }
];

const ヌ = [
  { no: 759, name: "ヌイコグマ" },
  { no: 195, name: "ヌオー" },
  { no: 259, name: "ヌマクロー" },
  { no: 705, name: "ヌメイル" },
  { no: 704, name: "ヌメラ" },
  { no: 706, name: "ヌメルゴン" }
];

const ネ = [
  { no: 177, name: "ネイティ" },
  { no: 178, name: "ネイティオ" },
  { no: 457, name: "ネオラント" },
  { no: 800, name: "ネクロズマ" },
  { no: 775, name: "ネッコアラ" },
  { no: 755, name: "ネマシュ" },
  { no: 344, name: "ネンドール" }
];

const ノ = [
  { no: 332, name: "ノクタス" },
  { no: 206, name: "ノコッチ" },
  { no: 299, name: "ノズパス" }
];

const ハ = [
  { no: 507, name: "ハーデリア" },
  { no: 366, name: "パールル" },
  { no: 584, name: "バイバニラ" },
  { no: 86, name: "パウワウ" },
  { no: 514, name: "バオッキー" },
  { no: 513, name: "バオップ" },
  { no: 208, name: "ハガネール" },
  { no: 779, name: "ハギギシリ" },
  { no: 323, name: "バクーダ" },
  { no: 295, name: "バクオング" },
  { no: 776, name: "バクガメス" },
  { no: 148, name: "ハクリュー" },
  { no: 710, name: "バケッチャ" },
  { no: 257, name: "バシャーモ" },
  { no: 271, name: "ハスブレロ" },
  { no: 270, name: "ハスボー" },
  { no: 550, name: "バスラオ" },
  { no: 12, name: "バタフリー" },
  { no: 595, name: "バチュル" },
  { no: 417, name: "パチリス" },
  { no: 212, name: "ハッサム" },
  { no: 327, name: "パッチール" },
  { no: 520, name: "ハトーボー" },
  { no: 582, name: "バニプッチ" },
  { no: 583, name: "バニリッチ" },
  { no: 187, name: "ハネッコ" },
  { no: 325, name: "バネブー" },
  { no: 542, name: "ハハコモリ" },
  { no: 242, name: "ハピナス" },
  { no: 336, name: "ハブネーク" },
  { no: 388, name: "ハヤシガメ" },
  { no: 46, name: "パラス" },
  { no: 47, name: "パラセクト" },
  { no: 297, name: "ハリテヤマ" },
  { no: 651, name: "ハリボーグ" },
  { no: 122, name: "バリヤード" },
  { no: 484, name: "パルキア" },
  { no: 236, name: "バルキー" },
  { no: 630, name: "バルジーナ" },
  { no: 629, name: "バルチャイ" },
  { no: 313, name: "バルビート" },
  { no: 248, name: "バンギラス" },
  { no: 367, name: "ハンテール" },
  { no: 750, name: "バンバドロ" },
  { no: 711, name: "パンプジン" }
];

const ヒ = [
  { no: 173, name: "ピィ" },
  { no: 400, name: "ビーダル" },
  { no: 13, name: "ビードル" },
  { no: 25, name: "ピカチュウ" },
  { no: 36, name: "ピクシー" },
  { no: 494, name: "ビクティニ" },
  { no: 390, name: "ヒコザル" },
  { no: 18, name: "ピジョット" },
  { no: 172, name: "ピチュー" },
  { no: 399, name: "ビッパ" },
  { no: 35, name: "ピッピ" },
  { no: 747, name: "ヒドイデ" },
  { no: 4, name: "ヒトカゲ" },
  { no: 679, name: "ヒトツキ" },
  { no: 607, name: "ヒトモシ" },
  { no: 155, name: "ヒノアラシ" },
  { no: 662, name: "ヒノヤコマ" },
  { no: 555, name: "ヒヒダルマ" },
  { no: 329, name: "ビブラーバ" },
  { no: 449, name: "ヒポポタス" },
  { no: 191, name: "ヒマナッツ" },
  { no: 216, name: "ヒメグマ" },
  { no: 516, name: "ヒヤッキー" },
  { no: 515, name: "ヒヤップ" },
  { no: 100, name: "ビリリダマ" },
  { no: 349, name: "ヒンバス" },
  { no: 440, name: "ピンプク" }
];

const フ = [
  { no: 663, name: "ファイアロー" },
  { no: 146, name: "ファイヤー" },
  { no: 489, name: "フィオネ" },
  { no: 418, name: "ブイゼル" },
  { no: 136, name: "ブースター" },
  { no: 720, name: "フーパ" },
  { no: 126, name: "ブーバー" },
  { no: 326, name: "ブーピッグ" },
  { no: 795, name: "フェローチェ" },
  { no: 653, name: "フォッコ" },
  { no: 205, name: "フォレトス" },
  { no: 443, name: "フカマル" },
  { no: 723, name: "フクスロー" },
  { no: 2, name: "フシギソウ" },
  { no: 1, name: "フシギダネ" },
  { no: 3, name: "フシギバナ" },
  { no: 543, name: "フシデ" },
  { no: 502, name: "フタチマル" },
  { no: 142, name: "プテラ" },
  { no: 432, name: "ブニャット" },
  { no: 240, name: "ブビィ" },
  { no: 671, name: "フラージェス" },
  { no: 670, name: "フラエッテ" },
  { no: 311, name: "プラスル" },
  { no: 197, name: "ブラッキー" },
  { no: 669, name: "フラベベ" },
  { no: 144, name: "フリーザー" },
  { no: 615, name: "フリージオ" },
  { no: 209, name: "ブルー" },
  { no: 592, name: "プルリル" },
  { no: 593, name: "ブルンゲル" },
  { no: 419, name: "フローゼル" },
  { no: 693, name: "ブロスター" },
  { no: 564, name: "プロトーガ" },
  { no: 426, name: "フワライド" },
  { no: 425, name: "フワンテ" }
];

const ヘ = [
  { no: 341, name: "ヘイガニ" },
  { no: 153, name: "ベイリーフ" },
  { no: 88, name: "ベトベター" },
  { no: 803, name: "ベベノム" },
  { no: 214, name: "ヘラクロス" },
  { no: 441, name: "ペラップ" },
  { no: 279, name: "ペリッパー" },
  { no: 229, name: "ヘルガー" },
  { no: 684, name: "ペロッパフ" },
  { no: 463, name: "ベロベルト" },
  { no: 685, name: "ペロリーム" },
  { no: 108, name: "ベロリンガ" },
  { no: 545, name: "ペンドラー" }
];

const ホ = [
  { no: 544, name: "ホイーガ" },
  { no: 250, name: "ホウオウ" },
  { no: 321, name: "ホエルオー" },
  { no: 320, name: "ホエルコ" },
  { no: 163, name: "ホーホー" },
  { no: 373, name: "ボーマンダ" },
  { no: 498, name: "ポカブ" },
  { no: 708, name: "ボクレー" },
  { no: 306, name: "ボスゴドラ" },
  { no: 261, name: "ポチエナ" },
  { no: 394, name: "ポッタイシ" },
  { no: 393, name: "ポッチャマ" },
  { no: 16, name: "ポッポ" },
  { no: 77, name: "ポニータ" },
  { no: 188, name: "ポポッコ" },
  { no: 233, name: "ポリゴン2" },
  { no: 474, name: "ポリゴンZ" },
  { no: 660, name: "ホルード" },
  { no: 642, name: "ボルトロス" },
  { no: 659, name: "ホルビー" },
  { no: 351, name: "ポワルン" }
];

const マ = [
  { no: 686, name: "マーイーカ" },
  { no: 802, name: "マーシャドー" },
  { no: 801, name: "マギアナ" },
  { no: 219, name: "マグカルゴ" },
  { no: 296, name: "マクノシタ" },
  { no: 218, name: "マグマッグ" },
  { no: 156, name: "マグマラシ" },
  { no: 739, name: "マケンカニ" },
  { no: 756, name: "マシェード" },
  { no: 455, name: "マスキッパ" },
  { no: 69, name: "マダツボミ" },
  { no: 110, name: "マタドガス" },
  { no: 618, name: "マッギョ" },
  { no: 264, name: "マッスグマ" },
  { no: 490, name: "マナフィ" },
  { no: 461, name: "マニューラ" },
  { no: 439, name: "マネネ" },
  { no: 655, name: "マフォクシー" },
  { no: 594, name: "ママンボウ" },
  { no: 519, name: "マメパト" },
  { no: 268, name: "マユルド" },
  { no: 556, name: "マラカッチ" },
  { no: 183, name: "マリル" },
  { no: 184, name: "マリルリ" },
  { no: 317, name: "マルノーム" },
  { no: 56, name: "マンキー" },
  { no: 473, name: "マンムー" }
];

const ミ = [
  { no: 442, name: "ミカルゲ" },
  { no: 501, name: "ミジュマル" },
  { no: 258, name: "ミズゴロウ" },
  { no: 415, name: "ミツハニー" },
  { no: 147, name: "ミニリュウ" },
  { no: 504, name: "ミネズミ" },
  { no: 413, name: "ミノマダム" },
  { no: 412, name: "ミノムッチ" },
  { no: 778, name: "ミミッキュ" },
  { no: 428, name: "ミミロップ" },
  { no: 427, name: "ミミロル" },
  { no: 151, name: "ミュウ" },
  { no: 150, name: "ミュウツー" },
  { no: 241, name: "ミルタンク" },
  { no: 505, name: "ミルホッグ" },
  { no: 350, name: "ミロカロス" }
];

const ム = [
  { no: 200, name: "ムウマ" },
  { no: 429, name: "ムウマージ" },
  { no: 508, name: "ムーランド" },
  { no: 397, name: "ムクバード" },
  { no: 398, name: "ムクホーク" },
  { no: 518, name: "ムシャーナ" },
  { no: 238, name: "ムチュール" },
  { no: 396, name: "ムックル" },
  { no: 517, name: "ムンナ" }
];

const メ = [
  { no: 672, name: "メェークル" },
  { no: 154, name: "メガニウム" },
  { no: 469, name: "メガヤンマ" },
  { no: 551, name: "メグロコ" },
  { no: 376, name: "メタグロス" },
  { no: 375, name: "メタング" },
  { no: 774, name: "メテノ" },
  { no: 72, name: "メノクラゲ" },
  { no: 586, name: "メブキジカ" },
  { no: 636, name: "メラルバ" },
  { no: 179, name: "メリープ" },
  { no: 809, name: "メルメタル" },
  { no: 703, name: "メレシー" },
  { no: 648, name: "メロエッタ" }
];

const モ = [
  { no: 391, name: "モウカザル" },
  { no: 529, name: "モグリュー" },
  { no: 722, name: "モクロー" },
  { no: 180, name: "モココ" },
  { no: 465, name: "モジャンボ" },
  { no: 633, name: "モノズ" },
  { no: 591, name: "モロバレル" },
  { no: 114, name: "モンジャラ" },
  { no: 546, name: "モンメン" }
];

const ヤ = [
  { no: 757, name: "ヤトウモリ" },
  { no: 199, name: "ヤドキング" },
  { no: 512, name: "ヤナッキー" },
  { no: 511, name: "ヤナップ" },
  { no: 198, name: "ヤミカラス" },
  { no: 302, name: "ヤミラミ" },
  { no: 661, name: "ヤヤコマ" },
  { no: 288, name: "ヤルキモノ" },
  { no: 734, name: "ヤングース" },
  { no: 674, name: "ヤンチャム" },
  { no: 193, name: "ヤンヤンマ" }
];

const ユ = [
  { no: 459, name: "ユキカブリ" },
  { no: 460, name: "ユキノオー" },
  { no: 478, name: "ユキメノコ" },
  { no: 361, name: "ユキワラシ" },
  { no: 480, name: "ユクシー" },
  { no: 346, name: "ユレイドル" },
  { no: 64, name: "ユンゲラー" }
];

const ヨ = [
  { no: 246, name: "ヨーギラス" },
  { no: 506, name: "ヨーテリー" },
  { no: 477, name: "ヨノワール" },
  { no: 355, name: "ヨマワル" },
  { no: 164, name: "ヨルノズク" },
  { no: 746, name: "ヨワシ" }
];

const ラ = [
  { no: 243, name: "ライコウ" },
  { no: 26, name: "ライチュウ" },
  { no: 310, name: "ライボルト" },
  { no: 260, name: "ラグラージ" },
  { no: 309, name: "ラクライ" },
  { no: 113, name: "ラッキー" },
  { no: 20, name: "ラッタ" },
  { no: 380, name: "ラティアス" },
  { no: 381, name: "ラティオス" },
  { no: 370, name: "ラブカス" },
  { no: 131, name: "ラプラス" },
  { no: 45, name: "ラフレシア" },
  { no: 409, name: "ラムパルド" },
  { no: 754, name: "ラランテス" },
  { no: 280, name: "ラルトス" },
  { no: 579, name: "ランクルス" },
  { no: 645, name: "ランドロス" },
  { no: 608, name: "ランプラー" }
];

const リ = [
  { no: 470, name: "リーフィア" },
  { no: 447, name: "リオル" },
  { no: 605, name: "リグレー" },
  { no: 5, name: "リザード" },
  { no: 345, name: "リリーラ" },
  { no: 217, name: "リングマ" }
];

const ル = [
  { no: 124, name: "ルージュラ" },
  { no: 448, name: "ルカリオ" },
  { no: 249, name: "ルギア" },
  { no: 404, name: "ルクシオ" },
  { no: 701, name: "ルチャブル" },
  { no: 792, name: "ルナアーラ" },
  { no: 298, name: "ルリリ" },
  { no: 272, name: "ルンパッパ" }
];

const レ = [
  { no: 82, name: "レアコイル" },
  { no: 378, name: "レジアイス" },
  { no: 486, name: "レジギガス" },
  { no: 379, name: "レジスチル" },
  { no: 643, name: "レシラム" },
  { no: 377, name: "レジロック" },
  { no: 384, name: "レックウザ" },
  { no: 165, name: "レディバ" },
  { no: 510, name: "レパルダス" },
  { no: 405, name: "レントラー" }
];

const ロ = [
  { no: 407, name: "ロズレイド" },
  { no: 315, name: "ロゼリア" },
  { no: 479, name: "ロトム" }
];

const ワ = [
  { no: 256, name: "ワカシャモ" },
  { no: 189, name: "ワタッコ" },
  { no: 158, name: "ワニノコ" },
  { no: 553, name: "ワルビアル" },
  { no: 552, name: "ワルビル" },
  { no: 66, name: "ワンリキー" }
];

export default {
  ア,
  イ,
  ウ,
  エ,
  オ,
  カ,
  キ,
  ク,
  ケ,
  コ,
  サ,
  シ,
  ス,
  セ,
  ソ,
  タ,
  チ,
  ツ,
  テ,
  ト,
  ナ,
  ニ,
  ヌ,
  ネ,
  ノ,
  ハ,
  ヒ,
  フ,
  ヘ,
  ホ,
  マ,
  ミ,
  ム,
  メ,
  モ,
  ヤ,
  ユ,
  ヨ,
  ラ,
  リ,
  ル,
  レ,
  ロ,
  ワ
} as IPokemonLists;
